app/views/users/show.html.erb

SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = $1  [["user_id", "1"]]
---
              <ol>
                <% Search.where(user_id: session.id).each do |search| %>