app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "weil@weil.com"], ["LIMIT", 1]]